================================================================================
Test setting with no comments
================================================================================

127.0.0.1 localhost

--------------------------------------------------------------------------------

(config
  (setting))

================================================================================
Test comments starting lines
================================================================================

#A comment
# Another comment

--------------------------------------------------------------------------------

(config
  (comment)
  (comment))

================================================================================
Test settings that include comment token
================================================================================

text#text

--------------------------------------------------------------------------------

(config
  (setting))

================================================================================
Test settings with trailing comments
================================================================================

set mouse = true # A comment
set mouse = true #A comment

--------------------------------------------------------------------------------

(config
  (setting)
  (comment)
  (setting)
  (comment))

================================================================================
Test a mix of comments and settings
================================================================================

plain=off # comment
# A comment
set-option -g mouse on
::1             localhost

--------------------------------------------------------------------------------

(config
  (setting)
  (comment)
  (comment)
  (setting)
  (setting))
